Revit 2027 API
ParameterTypeId.StairstypeLeftSideSupportType Property
 "Left Support Type": Left Side Support Type
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairstypeLeftSideSupportType { get; }
Public Shared ReadOnly Property StairstypeLeftSideSupportType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairstypeLeftSideSupportType {
	ForgeTypeId^ get ();
}
static member StairstypeLeftSideSupportType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace